app/Http/Controllers/AuthController.php

select * from `users` where `email` = 'abccdd@gmail.com' limit 1
---
    public function login(LoginUserRequest $request){
        $request->validated($request->all());
        if(!Auth::attempt($request->only('email','password'))){
            return $this->error('','Credentials do not match', 401);
        }

        $user = User::where("email",$request->email)->first();

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('xAbu Bakr Siddiq', 'abccdde@gmail.com', '$2y$10$wg1IiuMyhgOGwHRhK0oAW.nez.anRKu1IbnQnZRrpg.FoKU3ihzxG', '2023-03-03 17:41:08', '2023-03-03 17:41:08')
---
    public function register(StoreUserRequest $request){
        $request->validated($request->all());

        $user = User::create([
            "name"      =>  $request->name,
            "email"     =>  $request->email,
            "password"  =>  Hash::make($request->password)
        ]);

delete from `personal_access_tokens` where `id` = 69
---
    public function logout(){
        return Auth::user();
        Auth::user()->currentAccessToken()->delete();