app/Http/Controllers/TasksController.php

select * from `tasks` where `user_id` = 1
---
    public function index()
    {
        return TasksResource::collection(
            Task::where('user_id',Auth::user()->id)->get()
        );

insert into `tasks` (`user_id`, `name`, `description`, `priority`, `updated_at`, `created_at`) values (1, 'New Tasks1', 'This is a new description', 'High', '2023-03-03 17:43:37', '2023-03-03 17:43:37')
---
    public function store(StoreTaskRequest $request)
    {
        $request->validated($request->all());

        $task = Task::create([
            "user_id"   =>  Auth::user()->id,
            "name"      =>  $request->name,
            "description"      =>  $request->description,
            "priority"      =>  $request->priority
        ]);